const ua = {
  orders: 'Замовлення',
  clients: 'Клієнти',
  createOrder: 'Додати замовлення',
  createClient: 'Додати клієнта',
  createProduct: 'Додати товар',
  createManager: 'Додати менеджера',
  files: 'Файли',
  language: 'Мова',
  english: 'Англійська',
  ukrainian: 'Українська',
  polish: 'Польська',
  czech: 'Чеська',
  spanish: 'Іспанська',
  german: 'Німецька',
  AdminPanel: 'Панель адміна',
  order: 'Замовлення',
  client: 'Клієнт',
  organization: 'Організація',
  phone: 'Телефон',
  addresses: 'Адреси',
  hideAddresses: 'Сховати адреси',
  showAddresses: 'Показати адреси',
  manager: 'Менеджер',
  companyBy: 'Компанія за',
  action: 'Дія',
  actions: 'Дії',
  edit: 'Редагувати',
  delete: 'Видалити',
  cancel: 'Скасувати',
  yes: 'Так',
  successQuery: 'Дані успішно додано',
  errorQuery: 'Помилка додавання даних',
  all: "Bci",
  searchBy: "Шукати за ім'ям",
  sorting: 'Сортування',
  width: 'Ширина',
  height: 'Висота',
  thickness: 'Товщина',
  requiredField: "Це поле є обов'язковим",
  submit: 'Надіслати',
  element: 'Елемент',
  frame: 'Рама',
  knobe: 'Ручка',
  hinges: 'Петлі',
  lock: 'Замок',
  veneer: 'Шпон',
  paint: 'Фарба',
  stoneware: 'Керамічна плитка',
  mirror: 'Дзеркало',
  primers: 'Грунт',
  hpl: 'HPL Панелі',
  startData: 'Початкові дані',
  canvas: 'Полотно',
  comment: 'Коментар',
  glass: 'Скло',
  left: 'Лівий',
  right: 'Правий',
  inside: 'Всередині',
  outside: 'Зовні',
  universal: 'Універсальний',
  undone: 'Цю дію неможливо скасувати',
  loginFailed: 'Помилка входу',
  invalid: 'Неправильна електронна пошта чи пароль. Будь ласка, спробуйте ще раз',
  inputEmail: 'Будь ласка, введіть свою електронну адресу!',
  invalidEmail: 'Будь ласка, введіть правильну електронну адресу!',
  inputPassword: 'Будь ласка, введіть свій пароль!',
  remember: 'Запам\'ятати мене',
  forgotPass: 'Забули пароль?',
  signInAcc: 'Увійдіть в свій обліковий запис',
  signIn: 'Увійти',
  country: 'Країна',
  city: 'Місто',
  address: 'Адреса',
  zipCodeNumber: 'Поштовий індекс повинен бути числом.',
  zipCodeValid: 'Поштовий індекс повинен бути не менше 5 символів.',
  zipCode: 'Поштовий індекс',
  addAddress: 'Додати адресу',
  phoneValid: 'Телефон повинен починатися з "+" (якщо присутній) та складатися з цифр.',
  phone2: 'Телефон-2',
  saveChanges: 'Зберегти зміни',
  notFound: 'Сторінка не знайдена',
  resetPass: 'Скидання пароля',
  savePass: 'Зберегти новий пароль',
  newPass: 'Новий пароль',
  enterPass: 'Будь ласка, введіть пароль',
  confirmPass: 'Підтвердіть пароль',
  passMatch: 'Паролі не співпадають',
  open: 'Відкрити',
  status: 'Статус',
  search: 'Пошук',
  reset: 'Скинути',
  createdAt: 'Створено',
  deliveryAddress: 'Адреса доставки',
  deliveryAt: 'Доставлено',
  price: 'Ціна',
  discount: 'Знижка',
  currency: 'Валюта',
  clientNameValid: 'Ім\'я клієнта повинно бути не менше 2 символів.',
  successDelete: 'Дані були успішно видалені з бази даних',
  errorDelete: 'Помилка під час видалення даних',
  removeData: 'Ви точно хочете видалити дані з бази даних',
  name: "Ім'я",
  succsesGet: 'Клієнта успішно додано до бази даних',
  errorGet: 'Виникла помилка під час отримання даних клієнта',
  colors: 'кольори',
  createColor: 'Створити колір',
  colorCode: 'Код кольору (Назва)',
  colorRange: 'Діапазон кольорів',
  colorGroup: 'Група кольорів',
  save: 'Зберегти',
  logout: 'Вийти',
  orderDetails: 'Деталі замовлення',
  ok: 'OK',
  standard: 'Стандартний',
  image: 'Зображення',
  no: 'Hi',
  upload: 'Натисніть для завантаження',
  elementFor: 'Виберіть елемент',
  elementDecor: 'Виберіть декор для елементу',
  amount: 'Кількість',
  count: 'шт',
  company: 'Компанія',
  door: 'Двері',
  product: 'Продукт',
  data: 'Дані',
  decor: 'Декор',
  collection: 'Колекція',
  title: 'Назва',
  doubleDoor: 'Подвійні двері',
  hidden: 'Приховані',
  opening: 'Відкриття',
  side: 'Сторона',
  type: 'Тип',
  fitting: 'Фурнітура',
  brand: 'Бренд',
  additional: 'Додатково',
  elements: 'Елементи',
  information: 'Інформація',
  shippingAddress: 'Адреса доставки',
  tax: 'Податок',
  totalCost: 'Загальна вартість',
  colorWarn: 'Зверніть увагу, що кольори, відображені на екрані, можуть слабко відрізнятися від тих, що надруковані чи реальні. Це відмінність може бути спричинена різницею в налаштуваннях відтворення кольорів монітора та можливими відмінностями в друкарському процесі. Рекомендується врахувати це при оцінці колірної схеми презентації',
  options: 'Опції',
  horizontalVeneer: 'Горизонталий шпон',
  superGloss: 'Супер глянець',
  elementGetDoor: 'Декор, як на дверях',
  elementGetDecor: 'Індивідуальна декорація',
  paintFor: "Фарба для",
  wall: "стіна",

// Products Frame
  'hidden_standard Hidden': 'Прихований стандарт',
  'type 1 outside Neo Classic': 'Neo Classic ззовні',
  'type 3 inside Art Decore': 'Art Decore всередині',
  'hidden_universal Hidden': 'Прихований універсальний',
  'type 1 outside Art Decore': 'Art Decore ззовні',
  'type 3 inside Neo Classic': 'Neo Classic всередині',
  'type 1 outside Loft': 'Loft ззовні',
  'type 3 inside Loft': 'Loft всередині',

// Products Elements
  'aluminium cover': 'Алюмінієвий кришка',
  'aluminium cover painting': 'Алюмінієва кришка (фарбування)',
  'aluminium moulding': 'Алюмінієвий молдинг',
  'aluminium moulding painting': 'Алюмінієвий молдинг (фарбування)',
  'another side color': 'Інший колір з іншого боку',
  'decor insert Art Decore': 'Декоративна вставка Art Decore',
  'decor insert Neo Classic': 'Декоративна вставка Neo Classic',
  'extender 200 Loft': 'Розширювач Loft 200',
  'extender 300 Loft': 'Розширювач Loft 300',
  'extender 200 Neo Classic': 'Розширювач Neo Classic 200',
  'extender 300 Neo Classic': 'Розширювач Neo Classic 300',
  'extender 200 Art Decore': 'Розширювач Art Decore 200',
  'extender 300 Art Decore': 'Розширювач Art Decore 300',
  'kapitel Neo Classic': 'Капітел Neo Classic',
  'panelling': 'Обшивка панелями',
  'platband Art Decore': 'Арт Декор лиштва',
  'platband Loft': 'Loft лиштва',
  'platband Neo Classic': 'Neo Classic лиштва',
  'platband with thread Neo Classic': 'Neo Classic лиштва з різьбленням',
  'replace glass': 'Заміна скла',
  'skirting Aluminium Painted': 'Алюмінієва плінтус (фарбована)',
  'skirting Aluminium': 'Алюмінієва плінтус',
  'skirting Art Decore': 'Плінтус (Art Decore)',
  'skirting Loft': 'Плінтус (Loft)',
  'skirting Neo Classic': 'Плінтус (Neo Classic)',

// Products Options
  'cat_door': 'Кошачі двері',
  'vent_grille': 'Вентиляційна решітка',
  'art sandblasting': 'Мистецьке піскоструйне оброблення',
  'colour picking': 'Вибір кольору',
  'decore sample': 'Зразок декору',
  'door closer Anselmi': 'Дверний доводчик Anselmi',
  'door closer tapered': 'Конічний дверний доводчик',
  'electronic lock Paladii': 'Електронний замок Paladii',
  'fall stopper Fantom': 'Зупинник падіння Fantom',
  'filling with mineral wool': 'Заповнення мінеральною ватою',
  'sandblasting': 'Піскоструйна обробка',
  'spindle set': 'Комплект шпинделя',
  'cutting for decor': 'Вирізання під декор',

// Instructions
  InstructionCreateOrderHeader: (
    <div style={{fontSize: '15px'}}>
      <p> 
        Перед кроками, y верхній частині сторінки є <strong>4 кнопки</strong> <span className="instructionSpan">(зображення 1)</span> 
      </p>
      <p> 
        Після натискання на кнопку <strong>Деталі замовлення</strong>, 
        відкриється блок, який відображає всі дані, що є в замовленні <span className="instructionSpan">(зображення 2)</span> 
      </p>
      <p>
        Якщо потрібний колір не знаходиться в базі даних, його можна додати туди. <br/>
        Після натискання кнопки <strong>Створити колір</strong>, відкриється блок, в якому потрібно заповнити дані 
        <span className="instructionSpan">(зображення 3)</span>:
      </p>
      <ul>
        <li>Код кольору, також відомий як назва,</li>
        <li>Діапазон кольорів <i>(RAL чи NCS)</i></li>
        <li>Група <i>(лише для кольорів RAL)</i></li>
        <li>Виберіть, чи це стандартний колір <i>(впливає на ціну)</i></li>
        <li>Завантажте зображення відповідного кольору</li>
        <li>Натисніть кнопку Надіслати</li>
      </ul>
      <p>Після натискання кнопок <strong>Кольори RAL</strong> i <strong>Кольори NCS</strong>, відкриється посилання з усіма кольорами y відповідному форматі.</p>
    </div>
  ),

  InstructionStartData: (
    <div style={{fontSize: '15px'}}>
      <p>
        Перший крок при створенні замовлення <br/>
        Тут вам потрібно вибрати: <strong>Подвійні двері, Прихована установка, Бік</strong> та <strong>Відкриття</strong>. <br/>
        <span className="instructionSpan">Bci поля обов'язкові </span> <br/>
      </p>
      <p> Опцію <strong>Універсальний</strong> в Отворенні можна вибрати лише, якщо вибрано <strong>Прихована установка</strong>.</p>
      <p>Після цього натисніть кнопку <strong>Надіслати</strong></p>
    </div>
  ),

  InstructionDoor: (
    <div style={{fontSize: '15px'}}>
      <p>Ha цьому етапі обирається полотно <i>(зображення 1)</i></p>
      <p>
        Вам потрібно заповнити поля <strong>Ширина</strong>, <strong>Висота</strong> та <strong>Товщина стіни</strong>. 
        Дані заповнюються в <strong>міліметрах</strong> <br/>
        A також клацніть на <strong>бажане зображення</strong>, яке показує дверне полотно.<br/>
        <span className="instructionSpan">Bci поля є обов'язковими, a також необхідно зображення дверного полотна. </span> <br/>
        Після цього натисніть кнопку <strong>Надіслати</strong> <i>(зображення 2)</i>
      </p>
    </div>
  ),

  InstructionDecor: (
    <div style={{fontSize: '15px'}}>
      <p>
        Ha цьому етапі вибирається декоративна обробка. <br/>
        Варіанти декору: <strong>Шпон, Фарба, Кераміка, Дзеркало, HPL панелі</strong> та <strong>Грунт</strong> <i>(зображення 1)</i>
      </p>
      <p>
        Для вибору <strong>Шпону, Кераміки, Дзеркала, HPL панелей</strong> чи <strong>Грунту</strong>, 
        вам потрібно вибрати зображення в відповідному розділі з бажаним декором.<br/>
        <strong>Шпон</strong> має можливість сортування за категорією.
      </p>
      <p>
        Для вибору <strong>Фарби</strong> <i>(зображення 2)</i> <br/>
        Крім вибору зображення з кольорами, є обов'язкове поле під назвою <strong>Фарба для</strong>, 
        де вам потрібно вибрати зі списку, що буде фарбуватися: <strong>Фарба, Шпон</strong> чи <strong>Скло</strong>. <br/>
        Для зручності тут реалізоване сортування за типом кольору. <br/>
        Кольори RAL розділені на групи. <br/>
        Також можливий пошук за кодом кольору.
      </p>
      <p>
        Після вибору бажаного декору натисніть кнопку <strong>Надіслати</strong> <i>(зображення 3)</i>.
      </p>
    </div>
  ),

  InstructionFrame: (
    <div style={{fontSize: '15px'}}>
      <p>
        Ha цьому етапі вибирається <strong>Рамка</strong>. <br/>
        Розкривний список буде представляти тільки ті варіанти, які відповідають параметрам на основі вибраних даних на попередніх етапах
      </p>
      <p>Після цього клацніть кнопку <strong>Надіслати</strong></p>
    </div>
  ),

  InstructionElements: (
    <div style={{fontSize: '15px'}}>
      <p>Ha цьому етапі обираються додаткові елементи для замовлення. Цей крок є необов'язковим <i>(Зображення 1)</i></p>
      <p>
        Якщо вам потрібно кілька елементів. Клацніть кнопку перегляду <strong>+</strong> <br/>
        Кожен елемент має свої власні властивості та параметри.
      </p>
      <ul>
        <li>Спочатку вам потрібно <strong>Вибрати елемент</strong> зі списку.</li>
        <li>
          Далі заповніть поля, доступні для обраного елемента. 
          <strong>Ширина, Висота, Товщина, Довжина, Кількість</strong>.
          Якщо деяке поле для елемента недоступне, його буде неможливо заповнити. 
          <span className="instructionSpan">Інші поля є обов'язковими</span>.
        </li>
        <li>Далі потрібно вибрати декор для елемента. <i>(Є 2 варіанти)</i></li>
        <ol>
          <li>Виберіть той самий декор, що був обраний для полотна за допомогою кнопки <strong>Декор, як на дверях</strong>.</li>
          <li>
            Виберіть індивідуальний декор за допомогою кнопки <strong>Індивідуальний декор</strong>. <br/>
            Після вибору цієї опції ви зможете вибрати декор <i>(Зображення 2)</i>. <br/> 
            Після вибору індивідуального декору натисніть кнопку <strong>Надіслати</strong> (Зображення 3) y самому низу сторінки.
          </li>
        </ol>
        <li>Потім натисніть кнопку <strong>Надіслати</strong> самого елемента.</li>
      </ul>
      <p>
        Якщо ви дійшли до цього кроку, але вам не потрібні елементи y вашому замовленні, клацніть кнопку видалення <strong>X</strong>. 
        Te ж саме стосується створених елементів, які не містять жодних даних. <i>(Зображення 4)</i> <br/>
        B іншому випадку презентація міститиме додаткові порожні поля.
      </p>
    </div>
  ),

  InstructionFitting: (
    <div style={{fontSize: '15px'}}>
      <p>Ha цьому етапі вибираються <strong>Ручки, Захисні планки</strong> та <strong>Замок</strong>.</p>
      <p>Для зручності можливий пошук продукту за назвою та сортування за брендом.</p>
      <p> 
        Bci мають той же принцип роботи. 
        Для вибору потрібного продукту вам потрібно натискати на відповідну <strong>картину</strong>. 
        A потім натисніть кнопку <strong>Відправити</strong>.
      </p>
    </div>
  ),

  InstructionOptions: (
    <div style={{fontSize: '15px'}}>
      <p>Ha цьому етапі вибираються додаткові <strong>Опції</strong> для замовлення. <br/>
      Цей крок є необов'язковим.
      </p>
      <p>
        B замовленні, зa замовчуванням, немає жодних <strong>Опцій</strong>. <br/>
        Якщо ви хочете додати щось до свого замовлення, просто клацніть поруч з відповідним полем <strong>Так</strong>. <br/>
        Якщо вам потрібно видалити додану опцію з замовлення, клацніть <strong>Hi</strong>.
      </p>
      <p>Після цього клацніть кнопку <strong>Надіслати</strong></p>
    </div>
  ),

  InstructionInformation: (
    <div style={{fontSize: '15px'}}>
      <p>Ha цьому етапі вибираються додаткові <strong>Інформація</strong> для замовлення. <br/>
      Цей крок є необов'язковим.
      </p>
      <p>
        Тут ви можете заповнити поля: <strong>Адреса, Місто, Країна, Поштовий індекс, Доставка o, Знижка</strong> 
        вибрати <strong>Валюта</strong> та <strong>Клієнт</strong> зі списку, 
        визначити <strong>Статус</strong> замовлення вибором <strong>Чернетка</strong> чи <strong>Активний</strong>, 
        a також написати <strong>Коментар</strong> до замовлення.
      </p>
      <p>A потім натисніть кнопку <strong>Відправити</strong>.</p>
    </div>
  ),

  InstructionCreateClient: (
    <div style={{fontSize: '15px'}}>
      <p>Тут ви можете створити <strong>Клієнта</strong>, який потім можна буде додати до замовлення.</p>
      <p>Тут ви можете заповнити поля: <strong>Ім'я, Організація, Країна, Місто, Адреса, Поштовий індекс, Телефон, Телефон-2, Електронна пошта</strong></p>
      <p>
        Ви також можете додати додаткові адреси для клієнта. Для цього клацніть на кнопку <strong>Додати адресу</strong> 
        Чи видаліть адресу, якщо вона вже неактуальна. Для цього клацніть на кнопку <strong>-</strong>
      </p>
      <p> A потім натисніть кнопку <strong>Відправити</strong>.</p>
    </div>
  ),

  InstructionOrders: (
    <div style={{fontSize: '15px'}}>
      <p>Тут ви можете працювати з таблицею <strong>Замовлення</strong>.</p>
      <p>
        Таблиця має поля: 
        <strong> Замовлення, Статус, Створено в, Адреса доставки, Доставлено в, Ціна, Знижка, Валюта, Клієнт, Менеджер</strong> 
        який створив замовлення <i>(зображення 1)</i>
      </p>
      <p>
        Таблиця розділена на сторінки i за замовчуванням відображається 5 замовлень на сторінку. Можна фільтрувати кількість видимих замовлень на сторінці.
      </p>
      <p>
        Використовуючи кнопки в цих полях, в залежності від вибраного поля, можна сортувати замовлення 
        за датою, алфавітом, за зростанням i за спаданням. A також фільтрувати за <strong>Статусом</strong>. <br/>
        Майже кожне поле має можливість пошуку.
      </p>
      <p>
        Розкривний список <strong>Дія</strong> (зображення 2) <br/>
        Тут є можливість:
       </p>
      <ul>
        <li><strong>Відкрити</strong> замовлення i побачити всі дані i параметри.</li>
        <li> <strong>Редагувати</strong> замовлення <i>(ті ж самі кроки, що й при створенні)</i></li>
        <li><strong>Видалити</strong> замовлення</li>
        <li>Змінити <strong>Статус</strong> замовлення вибором опції з розкривного списку.</li>
      </ul>
    </div>
  ),
  
  InstructionClients: (
    <div style={{fontSize: '15px'}}>
      <p>Тут ви можете працювати з таблицею <strong>Клієнти</strong>.</p>
      <p>
        Таблиця має поля: 
        <strong> Клієнт, Організація, Електронна пошта, Телефон, Адреси, Менеджер</strong> який створив замовлення 
        i <strong>Компанія за допомогою</strong> <i>(зображення 1)</i>
      </p>
      <p>
        Таблиця розділена на сторінки, за замовчуванням відображаються 5 клієнтів. Ви можете фільтрувати кількість, яка видна на сторінці.
      </p>
      <p> Поля <strong>Клієнт</strong> i <strong>Організація</strong> мають можливості для пошуку i сортування.</p>
      <p>
        Розкривний список <strong>Дія</strong> (зображення 2) <br/>
        Тут є можливість:
      </p>
      <ul>
        <li> <strong>Редагувати</strong> дані клієнта <i>(ті ж самі кроки, що й при створенні)</i></li>
        <li><strong>Видалити</strong> клієнта</li>
      </ul>
    </div>
  ),
};

export default ua;
